Autodesk.Revit.DB.Structure.AreaReinforcementType.CreateDefaultAreaReinforcementType(Autodesk.Revit.DB.Document)
Creates a new AreaReinforcementType object with a default name.
aDoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.AreaReinforcementType
An object that specifies the type of a Structural Area Reinforcement element in Autodesk Revit.
Remarks:
The clear cover settings can be accessed via this object.